{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":235746949,"authorName":"Gordon Paynter","from":"&quot;Gordon Paynter&quot; &lt;Gordon.Paynter@...&gt;","replyTo":"LIST","senderId":"jSLEl4ZLM_D6afAoaR9ihxpR2tvYehfOyJsapuqmgQl59i95xvI0mO3-C03IRtcRaH-Mat_rm3VM6Tfss4GoK1cssed3bpJftyZ3Yf42go6OAZtnCHCr","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[ANN] Web Curator Tool","postDate":"1161133901","msgId":3464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHM1MzYzNjIwLjAxNkBzaGFkYm9sdC5uYXRsaWIuZ292dC5uej4="},"prevInTopic":0,"nextInTopic":3559,"prevInTime":3463,"nextInTime":3465,"topicId":3464,"numMessagesInTopic":4,"msgSnippet":"Hi all: I thought the Heritrix community would be interested in the Web Curator Tool, a selective web harvesting tool that uses Heritrix (version 1.8) to","rawEmail":"Return-Path: &lt;Gordon.Paynter@...&gt;\r\nX-Sender: Gordon.Paynter@...\r\nX-Apparently-To: archive-crawler@yahoogroups.com\r\nReceived: (qmail 16687 invoked from network); 18 Oct 2006 01:11:58 -0000\r\nReceived: from unknown (66.218.67.33)\n  by m29.grp.scd.yahoo.com with QMQP; 18 Oct 2006 01:11:58 -0000\r\nReceived: from unknown (HELO jupiter.natlib.govt.nz) (210.55.131.76)\n  by mta7.grp.scd.yahoo.com with SMTP; 18 Oct 2006 01:11:57 -0000\r\nMessage-Id: &lt;s5363620.016@...&gt;\r\nX-Mailer: Novell GroupWise Internet Agent 6.5.4 \r\nDate: Wed, 18 Oct 2006 14:11:41 +1300\r\nTo: &lt;archive-crawler@yahoogroups.com&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Disposition: inline\r\nX-SEEmail-Version: 2.0\r\nX-SEEmail: Liverton v2.15 MailMarshal Configuration\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Gordon Paynter&quot; &lt;Gordon.Paynter@...&gt;\r\nSubject: [ANN] Web Curator Tool\r\nX-Yahoo-Group-Post: member; u=235746949\r\n\r\nHi all:\n\nI thought the Heritrix community would be interested in the Web Cu=\r\nrator Tool, a selective web harvesting tool that uses Heritrix (version 1.8=\r\n) to harvest web sites. (Selective web harvesting is where you are only int=\r\nerested in taking a small section of the web at a time). We&#39;ve recently rel=\r\neased the tool as free software.  I have included an announcement below, bu=\r\nt I thought I&#39;d give this forum a little more technical detail about how He=\r\nritrix is used.\n\nThe Web Curator Tool is designed to be used by non-technic=\r\nal end-users, who are supported by technical administrators.  We have put a=\r\n lot of work into the user interface, which is designed around the harvesti=\r\nng workflow.  Administrators can create and save &quot;harvest profiles&quot; (which =\r\nare very similar to Heritrix profiles), and have almost total control over =\r\nthe order.xml file through a web interface. The profile-editing web interfa=\r\nce is generated from the Heritrix classes in much the same way that the def=\r\nault Heritrix web interface is generated, and can be used to create a numbe=\r\nr of different profiles for use in different situations.  Non-technical use=\r\nrs define a harvest by setting the seed URLS, choosing a harvest profile, o=\r\nptionally setting some useful profile overrides (e.g. ignore robots.txt, li=\r\nmits on download size/time, exclusion patterns), then setting a schedule fo=\r\nr the crawl. They are notified when the crawl is complete, and can review t=\r\nhe results and submit them to an archive.\n\nIf you want more information abo=\r\nut the tool, head on over to http://webcurator.sf.net/ and take a look, or =\r\nsend me (or this list) an email.  \n\nNow, on with the announcement...\n\n\n\nThe=\r\n National Library of New Zealand and The British Library are pleased to ann=\r\nounce the release of the Web Curator Tool as an open-source project.  The t=\r\nool, and its manuals, FAQs, mailing lists, source code, developer documenta=\r\ntion, and other information, are available from http://webcurator.sf.net/.\n=\r\n\n\nAbout the Web Curator Tool\n\nThe Web Curator Tool is a tool for managing t=\r\nhe selective web harvesting process. It is designed for non-technical users=\r\n in libraries and other collecting institutions who need to capture web mat=\r\nerial for archival purposes. The tool&#39;s workflow encompasses the following =\r\ntasks:\n\n* Harvest Authorisation: seeking and recording permission to harves=\r\nt web material, and to make it accessible to the general public.\n\n* Selecti=\r\non and scoping: determining what material should be harvested, be it a web =\r\nsite, a web page, a partial web site, a group (or collection) of web sites,=\r\n or any combination of these.\n\n* Scheduling: determining when a harvest sho=\r\nuld occur, and when it should be repeated.\n\n* Description: describing harve=\r\nsts  with basic Dublin Core metadata, and other specialized fields (or a by=\r\n a providing a reference to an external catalogue).\n\n* Harvesting: the Web =\r\nCurator Tool will download the selected web material at the appointed time =\r\nusing the Internet Archive&#39;s Heritrix web crawler -- each installation can =\r\nhave multiple harvesters on different machines, each which can perform seve=\r\nral harvests simultaneously.\n\n* Quality Review: tools are provided for maki=\r\nng sure the harvest worked as expected, and correcting simple harvest error=\r\ns.\n\n * Endorsing and submitting: if the harvest was a success, it is endors=\r\ned then submitted  to an external digital archive.\n\n\nInternational Collabor=\r\nation\n\nThe Web Curator Tool Project was a joint project undertaken by Natio=\r\nnal Library of New Zealand and the British Library and working with standar=\r\nds emerging from under the auspices of the International Internet Preservat=\r\nion Consortium (IIPC).  The software was built by Sytec Resources Ltd. in N=\r\new Zealand.\n\nEach partner provided around half the funding and contributed =\r\npersonnel to the project team and the test teams. Other IIPC member organis=\r\nations provided invaluable assistance along the way, particularly the Natio=\r\nnal Library of Australia (procurement and design) and the Library of Congre=\r\nss (requirements and specifications).\n\nThe main goal of the project was to =\r\ndesign and build a Web Curator Tool that meets the needs of the two partner=\r\ns, and that is modular and can be extended to meet the needs of IIPC member=\r\ns and other collecting organisations. This ambition was realised with the o=\r\npen-source release of the tool on 22 September 2006.\n\nGoing forward, we hop=\r\ne a wider community of IIPC members, national libraries, and other collecti=\r\nng organisations will use and  benefit from the Web Curator Tool, and that =\r\nthey will make their own contributions to its future development and direct=\r\nion.\n\n\nTechnical details\n\nThe Web Curator Tool is designed to run in an ent=\r\nerprise setting, and would normally be installed by a system administrator =\r\n(it is not a desktop application).  Users access the software through a sta=\r\nndard web browser.\n\nIt requires Java (version 1.5), Apache Tomcat (version =\r\n5.5), a relational database, an external archive and/or access tool (such a=\r\ns WERA or Wayback), and (optionally) an LDAP directory for user authenticat=\r\nion.\n\nThe software is tested on Solaris (version 9) and Red Hat Linux. It h=\r\nas been installed and run on Windows and on Debian Linux, and should work o=\r\nn any platform that supports Apache Tomcat. The Oracle and PostgreSQL datab=\r\nases are officially supported (by testing and installation scripts), MySQL =\r\nhas been used, and any database that Hibernate supports (including MySQL, M=\r\nicrosoft SQL Server, and about 20 others) should be compatible.\n\nThe Web Cu=\r\nrator Tool is Free Software, distributed under the terms of the Apache Publ=\r\nic License (version 2.0). It incorporates parts or all of several other Fre=\r\ne Software packages, including Acegi Security System, Apache Axis, Apache C=\r\nommons Logging, Heritrix (version 1.8), Hibernate (database connectivity), =\r\nQuartz (scheduling), Spring Application Framework, and Wayback (version 0.6=\r\n).\n\nRecent builds, the current source code, and developer documentation are=\r\n available from http://webcurator.sf.net/.\n\n\nMore information\n\nFor more inf=\r\normation, including a full description, Quick Start and System Administrato=\r\nr Guides, and updates on the project, please visit the Web Curator Tool web=\r\nsite, join the mailing lists (available from the website), or email the pro=\r\nject team, who will be pleased to take your comments and respond to your qu=\r\neries.\n\nWebsite: http://webcurator.sf.net/ \nNational Library of New Zealand=\r\n team: wct@... \nBritish Library team: wct@... \n\n\n"}}